; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-6nodes-1000size-3degree-100mindistance-3trucks-4packages-836seed

(define (problem transport-three-cities-sequential-6nodes-1000size-3degree-100mindistance-3trucks-4packages-836seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-3-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 279,210 -> 126,95
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 20)
  ; 126,95 -> 279,210
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 20)
  ; 166,400 -> 126,95
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 31)
  ; 126,95 -> 166,400
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 31)
  ; 166,400 -> 279,210
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 23)
  ; 279,210 -> 166,400
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 23)
  ; 9,547 -> 126,95
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 47)
  ; 126,95 -> 9,547
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 47)
  ; 9,547 -> 279,210
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 44)
  ; 279,210 -> 9,547
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 44)
  ; 9,547 -> 166,400
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 22)
  ; 166,400 -> 9,547
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 22)
  ; 284,520 -> 126,95
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 46)
  ; 126,95 -> 284,520
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 46)
  ; 284,520 -> 279,210
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 31)
  ; 279,210 -> 284,520
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 31)
  ; 284,520 -> 166,400
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 17)
  ; 166,400 -> 284,520
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 17)
  ; 284,520 -> 9,547
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 28)
  ; 9,547 -> 284,520
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 28)
  ; 148,971 -> 9,547
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 45)
  ; 9,547 -> 148,971
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 45)
  ; 148,971 -> 284,520
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 48)
  ; 284,520 -> 148,971
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 48)
  ; 2135,398 -> 2052,573
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 20)
  ; 2052,573 -> 2135,398
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 20)
  ; 2442,508 -> 2052,573
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 40)
  ; 2052,573 -> 2442,508
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 40)
  ; 2442,508 -> 2135,398
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 33)
  ; 2135,398 -> 2442,508
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 33)
  ; 2738,529 -> 2980,464
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 26)
  ; 2980,464 -> 2738,529
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 26)
  ; 2738,529 -> 2442,508
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 30)
  ; 2442,508 -> 2738,529
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 30)
  ; 2041,700 -> 2052,573
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 13)
  ; 2052,573 -> 2041,700
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 13)
  ; 2041,700 -> 2135,398
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 32)
  ; 2135,398 -> 2041,700
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 32)
  ; 2041,700 -> 2442,508
  (road city-2-loc-6 city-2-loc-4)
  (= (road-length city-2-loc-6 city-2-loc-4) 45)
  ; 2442,508 -> 2041,700
  (road city-2-loc-4 city-2-loc-6)
  (= (road-length city-2-loc-4 city-2-loc-6) 45)
  ; 1796,2830 -> 1350,2986
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 48)
  ; 1350,2986 -> 1796,2830
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 48)
  ; 1189,2580 -> 1350,2986
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 44)
  ; 1350,2986 -> 1189,2580
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 44)
  ; 1099,2414 -> 1189,2580
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 19)
  ; 1189,2580 -> 1099,2414
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 19)
  ; 1886,2475 -> 1796,2830
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 37)
  ; 1796,2830 -> 1886,2475
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 37)
  ; 1792,2296 -> 1886,2475
  (road city-3-loc-6 city-3-loc-5)
  (= (road-length city-3-loc-6 city-3-loc-5) 21)
  ; 1886,2475 -> 1792,2296
  (road city-3-loc-5 city-3-loc-6)
  (= (road-length city-3-loc-5 city-3-loc-6) 21)
  ; 284,520 <-> 2041,700
  (road city-1-loc-5 city-2-loc-6)
  (= (road-length city-1-loc-5 city-2-loc-6) 177)
  (road city-2-loc-6 city-1-loc-5)
  (= (road-length city-2-loc-6 city-1-loc-5) 177)
  (road city-1-loc-6 city-3-loc-6)
  (= (road-length city-1-loc-6 city-3-loc-6) 192)
  (road city-3-loc-6 city-1-loc-6)
  (= (road-length city-3-loc-6 city-1-loc-6) 192)
  (road city-2-loc-2 city-3-loc-6)
  (= (road-length city-2-loc-2 city-3-loc-6) 183)
  (road city-3-loc-6 city-2-loc-2)
  (= (road-length city-3-loc-6 city-2-loc-2) 183)
  (at package-1 city-3-loc-2)
  (at package-2 city-1-loc-5)
  (at package-3 city-2-loc-3)
  (at package-4 city-3-loc-1)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-3)
  (capacity truck-2 capacity-4)
  (at truck-3 city-1-loc-6)
  (capacity truck-3 capacity-3)
 )
 (:goal (and
  (at package-1 city-1-loc-1)
  (at package-2 city-3-loc-2)
  (at package-3 city-2-loc-5)
  (at package-4 city-3-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-1-loc-6 city-1-loc-5)
   deleted: (at truck-3 city-1-loc-6)
   added: (at truck-3 city-1-loc-5)
   goals met: 0 of 4
2. (pick-up truck-3 city-1-loc-5 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-5) (capacity truck-3 capacity-3)
   added: (in package-2 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 4
3. (drive truck-3 city-1-loc-5 city-1-loc-6)
   deleted: (at truck-3 city-1-loc-5)
   added: (at truck-3 city-1-loc-6)
   goals met: 0 of 4
4. (drive truck-3 city-1-loc-6 city-3-loc-6)
   deleted: (at truck-3 city-1-loc-6)
   added: (at truck-3 city-3-loc-6)
   goals met: 0 of 4
5. (drive truck-3 city-3-loc-6 city-3-loc-5)
   deleted: (at truck-3 city-3-loc-6)
   added: (at truck-3 city-3-loc-5)
   goals met: 0 of 4
6. (drive truck-3 city-3-loc-5 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-5)
   added: (at truck-3 city-3-loc-2)
   goals met: 0 of 4
7. (pick-up truck-3 city-3-loc-2 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-3-loc-2) (capacity truck-3 capacity-2)
   added: (in package-1 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 4
8. (drop truck-3 city-3-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-1)
   added: (at package-2 city-3-loc-2) (capacity truck-3 capacity-2)
   goals met: 1 of 4
9. (drive truck-3 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-1)
   goals met: 1 of 4
10. (pick-up truck-3 city-3-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-3-loc-1) (capacity truck-3 capacity-2)
   added: (in package-4 truck-3) (capacity truck-3 capacity-1)
   goals met: 1 of 4
11. (pick-up truck-2 city-2-loc-3 package-3 capacity-3 capacity-4)
   deleted: (at package-3 city-2-loc-3) (capacity truck-2 capacity-4)
   added: (in package-3 truck-2) (capacity truck-2 capacity-3)
   goals met: 1 of 4
12. (drive truck-3 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-3-loc-2)
   goals met: 1 of 4
13. (drive truck-3 city-3-loc-2 city-3-loc-5)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-5)
   goals met: 1 of 4
14. (drive truck-2 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-5)
   goals met: 1 of 4
15. (drop truck-2 city-2-loc-5 package-3 capacity-3 capacity-4)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-3)
   added: (at package-3 city-2-loc-5) (capacity truck-2 capacity-4)
   goals met: 2 of 4
16. (drop truck-3 city-3-loc-5 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-1)
   added: (at package-4 city-3-loc-5) (capacity truck-3 capacity-2)
   goals met: 3 of 4
17. (drive truck-3 city-3-loc-5 city-3-loc-6)
   deleted: (at truck-3 city-3-loc-5)
   added: (at truck-3 city-3-loc-6)
   goals met: 3 of 4
18. (drive truck-3 city-3-loc-6 city-1-loc-6)
   deleted: (at truck-3 city-3-loc-6)
   added: (at truck-3 city-1-loc-6)
   goals met: 3 of 4
19. (drive truck-3 city-1-loc-6 city-1-loc-4)
   deleted: (at truck-3 city-1-loc-6)
   added: (at truck-3 city-1-loc-4)
   goals met: 3 of 4
20. (drive truck-3 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-4)
   added: (at truck-3 city-1-loc-1)
   goals met: 3 of 4
21. (drop truck-3 city-1-loc-1 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-2)
   added: (at package-1 city-1-loc-1) (capacity truck-3 capacity-3)
   goals met: 4 of 4
